require "./setup"

_ Store.where(["address LIKE ?", "%横浜市%"])
# >>   Store Load (0.5ms)  SELECT `stores`.* FROM `stores` WHERE (address LIKE '%横浜市%')
# >> |----+----------+------------+---------------+------------+----------------------------------------+--------------------------------------------------------------+--------------+-----------+----------+------------|
# >> | id | store_cd | store_name | prefecture_cd | prefecture | address                                | address_kana                                                 | tel_no       | longitude | latitude | floor_area |
# >> |----+----------+------------+---------------+------------+----------------------------------------+--------------------------------------------------------------+--------------+-----------+----------+------------|
# >> |  3 | S14010   | 菊名店     |            14 | 神奈川県   | 神奈川県横浜市港北区菊名一丁目         | カナガワケンヨコハマシコウホククキクナイッチョウメ           | 045-123-4032 |   139.633 |  35.5005 |     1732.0 |
# >> |  4 | S14033   | 阿久和店   |            14 | 神奈川県   | 神奈川県横浜市瀬谷区阿久和西一丁目     | カナガワケンヨコハマシセヤクアクワニシイッチョウメ           | 045-123-4043 |   139.496 |  35.4592 |     1495.0 |
# >> |  8 | S14040   | 長津田店   |            14 | 神奈川県   | 神奈川県横浜市緑区長津田みなみ台五丁目 | カナガワケンヨコハマシミドリクナガツタミナミダイゴチョウメ   | 045-123-4046 |   139.499 |   35.524 |     1548.0 |
# >> | 10 | S14050   | 阿久和西店 |            14 | 神奈川県   | 神奈川県横浜市瀬谷区阿久和西一丁目     | カナガワケンヨコハマシセヤクアクワニシイッチョウメ           | 045-123-4053 |   139.496 |  35.4592 |     1830.0 |
# >> | 13 | S14028   | 二ツ橋店   |            14 | 神奈川県   | 神奈川県横浜市瀬谷区二ツ橋町           | カナガワケンヨコハマシセヤクフタツバシチョウ                 | 045-123-4042 |   139.496 |   35.463 |     1574.0 |
# >> | 17 | S14012   | 本牧和田店 |            14 | 神奈川県   | 神奈川県横浜市中区本牧和田             | カナガワケンヨコハマシナカクホンモクワダ                     | 045-123-4034 |   139.658 |  35.4216 |     1341.0 |
# >> | 19 | S14046   | 北山田店   |            14 | 神奈川県   | 神奈川県横浜市都筑区北山田一丁目       | カナガワケンヨコハマシツヅキクキタヤマタイッチョウメ         | 045-123-4049 |   139.592 |  35.5619 |      831.0 |
# >> | 21 | S14011   | 日吉本町店 |            14 | 神奈川県   | 神奈川県横浜市港北区日吉本町四丁目     | カナガワケンヨコハマシコウホククヒヨシホンチョウヨンチョウメ | 045-123-4033 |   139.632 |  35.5466 |      890.0 |
# >> | 27 | S14048   | 中川中央店 |            14 | 神奈川県   | 神奈川県横浜市都筑区中川中央二丁目     | カナガワケンヨコハマシツヅキクナカガワチュウオウニチョウメ   | 045-123-4051 |   139.576 |  35.5491 |     1657.0 |
# >> | 41 | S14042   | 新山下店   |            14 | 神奈川県   | 神奈川県横浜市中区新山下二丁目         | カナガワケンヨコハマシナカクシンヤマシタニチョウメ           | 045-123-4047 |   139.659 |  35.4389 |     1044.0 |
# >> | 53 | S14006   | 葛が谷店   |            14 | 神奈川県   | 神奈川県横浜市都筑区葛が谷             | カナガワケンヨコハマシツヅキククズガヤ                       | 045-123-4031 |   139.563 |  35.5357 |     1886.0 |
# >> |----+----------+------------+---------------+------------+----------------------------------------+--------------------------------------------------------------+--------------+-----------+----------+------------|
